In [2]:
import numpy as np
import pandas as pd

**문제1 : 학생들의 중간, 기말 고사 성적만으로 '총점'과 '평점' 추가하기**

In [3]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
                    {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
                    {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]

In [7]:
df = pd.DataFrame(friend_dict_list)
df['총점'] = df['중간고사점수']+ df['기말고사점수']
df['평점'] = (df['중간고사점수']+ df['기말고사점수'])/2
df

     이름  중간고사점수  기말고사점수   총점    평점
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

     이름  중간고사점수  기말고사점수   총점
0  나학생1      95      85  180
1  나학생2      85      80  165
2  나학생3      10      30   40

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [7]:
# 단순 컬럼명만 반복해서 출력

이름
중간고사점수
기말고사점수
총점
평균

In [8]:
# DataFrame에 row별 반환 해서 활용

0

이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균        90.0
Name: 0, dtype: object
1

이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균        82.5
Name: 1, dtype: object
2

이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균        20.0
Name: 2, dtype: object

**문제2 : DataFrame도 반복문으로 처리 가능 평균값을 반복문(for) 활용해서 출력해 보기**

90.0
82.5
20.0

**문제3 : grade(등급) 이라는 컬럼 추가, 90점이상(A), 80점이상(B), 그외 F등급 조건식 활용해서 파이썬 코드로 처리해 보기**

['A', 'B', 'F']

In [11]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [12]:
df['grade'] = grade
df

     이름  중간고사점수  기말고사점수   총점    평균 grade
0  나학생1      95      85  180  90.0     A
1  나학생2      85      80  165  82.5     B
2  나학생3      10      30   40  20.0     F

**문제4:'이수여부'라는 컬럼을 추가하되 등급을 기준으로 F인 경우 fail/F가 아닌 경우 pass 값으로 반영 단 lambda 문법으로 처리해 보기**

In [13]:
# apply() : 함수 호출 및 람다식적용시  사용하는 표현
# 조건식 적용시 if 조건식이 true인 경우 처리 로직은(반환값) if 키워드 앞단에 명시

     이름  중간고사점수  기말고사점수   총점    평균 grade  이수여부
0  나학생1      95      85  180  90.0     A  pass
1  나학생2      85      80  165  82.5     B  pass
2  나학생3      10      30   40  20.0     F  fail

**문제5: apply 함수를 사용해서 년월일 정보에서 년에 해당하는 정보만 반환**

apply() 특징

1. pandas.core.series.Series 제공하는 함수
2. 람다식 적용
3. 사용자 정의 함수도 적용
4. 함수명이 parameter로 반영, 호출하고자 하는 함수의 parameter개수만큼  
추가로 적용 가능
5. 호출 횟수는 Serise가 보유한 row수 데이터 수 만큼 자동 호출
6. 내부 로직 : 반복 로직 포함

In [14]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2018-12-20'}]

df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [15]:
df['yyyy-mm-dd']

0    2000-06-27
1    2002-09-24
2    2018-12-20
Name: yyyy-mm-dd, dtype: object

**문제 6 : gender별로 그룹화 하기**

In [23]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female